Vulnerability Test Results/artillery-load-test.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:3000' }}"
  phases:
    # 1. Warm-up phase
    - duration: 15
      arrivalRate: 10
      name: "Warm-up phase"
    # 2. Baseline Load: 100 concurrent virtual users sustained for 1 minute
    - duration: 60
      arrivalRate: 100
      name: "Baseline Load 100 VUs"
    # 3. Peak Stress phase
    - duration: 30
      arrivalRate: 250
      name: "Peak Stress phase"
  plugins:
    metrics-by-endpoint: {}
  defaults:
    headers:
      Content-Type: "application/json"
      User-Agent: "Artillery-SmartPriceAI/1.0"

scenarios:
  - name: "User Product Discovery & Price Compare Journey"
    flow:
      - get:
          url: "/api/config-status"
      - post:
          url: "/api/search"
          json:
            query: "dairymilk"
            city: "Chennai"
            pincode: "600028"
          capture:
            - json: "$.results[0].name"
              as: "topProductName"
      - think: 1
      - get:
          url: "/api/price-history?product=dairymilk"
      - get:
          url: "/api/geo/pincode?pincode=600028"
      - get:
          url: "/api/currency/rates"
